Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wifi_lora_32.menu.UploadSpeed.921600=921600
wifi_lora_32.menu.UploadSpeed.921600.upload.speed=921600
wifi_lora_32.menu.UploadSpeed.115200=115200
wifi_lora_32.menu.UploadSpeed.115200.upload.speed=115200
wifi_lora_32.menu.UploadSpeed.256000.windows=256000
wifi_lora_32.menu.UploadSpeed.256000.upload.speed=256000
wifi_lora_32.menu.UploadSpeed.230400.windows.upload.speed=256000
wifi_lora_32.menu.UploadSpeed.230400=230400
wifi_lora_32.menu.UploadSpeed.230400.upload.speed=230400
wifi_lora_32.menu.UploadSpeed.460800.linux=460800
wifi_lora_32.menu.UploadSpeed.460800.macosx=460800
wifi_lora_32.menu.UploadSpeed.460800.upload.speed=460800
wifi_lora_32.menu.UploadSpeed.512000.windows=512000
wifi_lora_32.menu.UploadSpeed.512000.upload.speed=512000

wifi_lora_32.menu.DebugLevel.none=None
wifi_lora_32.menu.DebugLevel.none.build.code_debug=0
wifi_lora_32.menu.DebugLevel.error=Error
wifi_lora_32.menu.DebugLevel.error.build.code_debug=1
wifi_lora_32.menu.DebugLevel.warn=Warn
wifi_lora_32.menu.DebugLevel.warn.build.code_debug=2
wifi_lora_32.menu.DebugLevel.info=Info
wifi_lora_32.menu.DebugLevel.info.build.code_debug=3
wifi_lora_32.menu.DebugLevel.debug=Debug
wifi_lora_32.menu.DebugLevel.debug.build.code_debug=4
wifi_lora_32.menu.DebugLevel.verbose=Verbose
wifi_lora_32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

wifi_lora_32_V2.name=WiFi LoRa 32(V2)

wifi_lora_32_V2.upload.tool=esptool_py
wifi_lora_32_V2.upload.maximum_size=1310720
wifi_lora_32_V2.upload.maximum_data_size=327680
wifi_lora_32_V2.upload.wait_for_upload_port=true

wifi_lora_32_V2.serial.disableDTR=true
wifi_lora_32_V2.serial.disableRTS=true

wifi_lora_32_V2.build.mcu=esp32
wifi_lora_32_V2.build.core=esp32
wifi_lora_32_V2.build.variant=wifi_lora_32_V2
wifi_lora_32_V2.build.board=WIFI_LORA_32_V2

wifi_lora_32_V2.build.f_cpu=240000000L
wifi_lora_32_V2.build.flash_size=8MB
wifi_lora_32_V2.build.flash_freq=40m
wifi_lora_32_V2.build.flash_mode=dio
wifi_lora_32_V2.build.boot=dio
wifi_lora_32_V2.build.partitions=default_8MB
wifi_lora_32_V2.build.defines=

wifi_lora_32_V2.menu.PSRAM.disabled=Disabled
wifi_lora_32_V2.menu.PSRAM.disabled.build.defines=
wifi_lora_32_V2.menu.PSRAM.enabled=Enabled
wifi_lora_32_V2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

wifi_lora_32_V2.menu.PartitionScheme.default=default_8MB
wifi_lora_32_V2.menu.PartitionScheme.default.build.partitions=default_8MB
wifi_lora_32_V2.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
wifi_lora_32_V2.menu.PartitionScheme.minimal.build.partitions=minimal
wifi_lora_32_V2.menu.PartitionScheme.no_ota=No OTA (Large APP)
wifi_lora_32_V2.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifi_lora_32_V2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifi_lora_32_V2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
wifi_lora_32_V2.menu.PartitionScheme.huge_app.build.partitions=huge_app
wifi_lora_32_V2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wifi_lora_32_V2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
wifi_lora_32_V2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifi_lora_32_V2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wifi_lora_32_V2.menu.PartitionScheme.fatflash=16M Fat
wifi_lora_32_V2.menu.PartitionScheme.fatflash.build.partitions=ffat

wifi_lora_32_V2.menu.CPUFreq.240=240MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.240.build.f_cpu=240000000L
wifi_lora_32_V2.menu.CPUFreq.160=160MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.160.build.f_cpu=160000000L
wifi_lora_32_V2.menu.CPUFreq.80=80MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.80.build.f_cpu=80000000L
wifi_lora_32_V2.menu.CPUFreq.40=40MHz (40MHz XTAL)
wifi_lora_32_V2.menu.CPUFreq.40.build.f_cpu=40000000L
wifi_lora_32_V2.menu.CPUFreq.20=20MHz (40MHz XTAL)
wifi_lora_32_V2.menu.CPUFreq.20.build.f_cpu=20000000L
wifi_lora_32_V2.menu.CPUFreq.10=10MHz (40MHz XTAL)
wifi_lora_32_V2.menu.CPUFreq.10.build.f_cpu=10000000L

wifi_lora_32_V2.menu.FlashMode.qio=QIO
wifi_lora_32_V2.menu.FlashMode.qio.build.flash_mode=dio
wifi_lora_32_V2.menu.FlashMode.qio.build.boot=qio
wifi_lora_32_V2.menu.FlashMode.dio=DIO
wifi_lora_32_V2.menu.FlashMode.dio.build.flash_mode=dio
wifi_lora_32_V2.menu.FlashMode.dio.build.boot=dio
wifi_lora_32_V2.menu.FlashMode.qout=QOUT
wifi_lora_32_V2.menu.FlashMode.qout.build.flash_mode=dout
wifi_lora_32_V2.menu.FlashMode.qout.build.boot=qout
wifi_lora_32_V2.menu.FlashMode.dout=DOUT
wifi_lora_32_V2.menu.FlashMode.dout.build.flash_mode=dout
wifi_lora_32_V2.menu.FlashMode.dout.build.boot=dout

wifi_lora_32_V2.menu.FlashFreq.80=80MHz
wifi_lora_32_V2.menu.FlashFreq.80.build.flash_freq=80m
wifi_lora_32_V2.menu.FlashFreq.40=40MHz
wifi_lora_32_V2.menu.FlashFreq.40.build.flash_freq=40m

wifi_lora_32_V2.menu.FlashSize.8M=8MB (64Mb)
wifi_lora_32_V2.menu.FlashSize.8M.build.flash_size=8MB
wifi_lora_32_V2.menu.FlashSize.8M.build.partitions=default_8MB
wifi_lora_32_V2.menu.FlashSize.4M=4MB (32Mb)
wifi_lora_32_V2.menu.FlashSize.4M.build.flash_size=4MB
wifi_lora_32_V2.menu.FlashSize.2M=2MB (16Mb)
wifi_lora_32_V2.menu.FlashSize.2M.build.flash_size=2MB
wifi_lora_32_V2.menu.FlashSize.2M.build.partitions=minimal
wifi_lora_32_V2.menu.FlashSize.16M=16MB (128Mb)
wifi_lora_32_V2.menu.FlashSize.16M.build.flash_size=16MB
wifi_lora_32_V2.menu.FlashSize.16M.build.partitions=ffat

wifi_lora_32_V2.menu.UploadSpeed.921600=921600
wifi_lora_32_V2.menu.UploadSpeed.921600.upload.speed=921600
wifi_lora_32_V2.menu.UploadSpeed.115200=115200
wifi_lora_32_V2.menu.UploadSpeed.115200.upload.speed=115200
wifi_lora_32_V2.menu.UploadSpeed.256000.windows=256000
wifi_lora_32_V2.menu.UploadSpeed.256000.upload.speed=256000
wifi_lora_32_V2.menu.UploadSpeed.230400.windows.upload.speed=256000
wifi_lora_32_V2.menu.UploadSpeed.230400=230400
wifi_lora_32_V2.menu.UploadSpeed.230400.upload.speed=230400
wifi_lora_32_V2.menu.UploadSpeed.460800.linux=460800
wifi_lora_32_V2.menu.UploadSpeed.460800.macosx=460800
wifi_lora_32_V2.menu.UploadSpeed.460800.upload.speed=460800
wifi_lora_32_V2.menu.UploadSpeed.512000.windows=512000
wifi_lora_32_V2.menu.UploadSpeed.512000.upload.speed=512000

wifi_lora_32_V2.menu.DebugLevel.none=None
wifi_lora_32_V2.menu.DebugLevel.none.build.code_debug=0
wifi_lora_32_V2.menu.DebugLevel.error=Error
wifi_lora_32_V2.menu.DebugLevel.error.build.code_debug=1
wifi_lora_32_V2.menu.DebugLevel.warn=Warn
wifi_lora_32_V2.menu.DebugLevel.warn.build.code_debug=2
wifi_lora_32_V2.menu.DebugLevel.info=Info
wifi_lora_32_V2.menu.DebugLevel.info.build.code_debug=3
wifi_lora_32_V2.menu.DebugLevel.debug=Debug
wifi_lora_32_V2.menu.DebugLevel.debug.build.code_debug=4
wifi_lora_32_V2.menu.DebugLevel.verbose=Verbose
wifi_lora_32_V2.menu.DebugLevel.verbose.build.code_debug=5

