Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
##############################################################

wireless_stick.name=Wireless Stick

wireless_stick.upload.tool=esptool_py
wireless_stick.upload.maximum_size=1310720
wireless_stick.upload.maximum_data_size=327680
wireless_stick.upload.wait_for_upload_port=true

wireless_stick.serial.disableDTR=true
wireless_stick.serial.disableRTS=true

wireless_stick.build.mcu=esp32
wireless_stick.build.core=esp32
wireless_stick.build.variant=wireless_stick
wireless_stick.build.board=WIRELESS_STICK

wireless_stick.build.f_cpu=240000000L
wireless_stick.build.flash_size=8MB
wireless_stick.build.flash_freq=40m
wireless_stick.build.flash_mode=dio
wireless_stick.build.boot=dio
wireless_stick.build.partitions=default_8MB
wireless_stick.build.defines=

wireless_stick.menu.PSRAM.disabled=Disabled
wireless_stick.menu.PSRAM.disabled.build.defines=
wireless_stick.menu.PSRAM.enabled=Enabled
wireless_stick.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

wireless_stick.menu.PartitionScheme.default=default_8MB
wireless_stick.menu.PartitionScheme.default.build.partitions=default_8MB
wireless_stick.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
wireless_stick.menu.PartitionScheme.minimal.build.partitions=minimal
wireless_stick.menu.PartitionScheme.no_ota=No OTA (Large APP)
wireless_stick.menu.PartitionScheme.no_ota.build.partitions=no_ota
wireless_stick.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wireless_stick.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
wireless_stick.menu.PartitionScheme.huge_app.build.partitions=huge_app
wireless_stick.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wireless_stick.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
wireless_stick.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wireless_stick.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wireless_stick.menu.PartitionScheme.fatflash=16M Fat
wireless_stick.menu.PartitionScheme.fatflash.build.partitions=ffat

wireless_stick.menu.CPUFreq.240=240MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_stick.menu.CPUFreq.160=160MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_stick.menu.CPUFreq.80=80MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.80.build.f_cpu=80000000L
wireless_stick.menu.CPUFreq.40=40MHz (40MHz XTAL)
wireless_stick.menu.CPUFreq.40.build.f_cpu=40000000L
wireless_stick.menu.CPUFreq.20=20MHz (40MHz XTAL)
wireless_stick.menu.CPUFreq.20.build.f_cpu=20000000L
wireless_stick.menu.CPUFreq.10=10MHz (40MHz XTAL)
wireless_stick.menu.CPUFreq.10.build.f_cpu=10000000L

wireless_stick.menu.FlashMode.qio=QIO
wireless_stick.menu.FlashMode.qio.build.flash_mode=dio
wireless_stick.menu.FlashMode.qio.build.boot=qio
wireless_stick.menu.FlashMode.dio=DIO
wireless_stick.menu.FlashMode.dio.build.flash_mode=dio
wireless_stick.menu.FlashMode.dio.build.boot=dio
wireless_stick.menu.FlashMode.qout=QOUT
wireless_stick.menu.FlashMode.qout.build.flash_mode=dout
wireless_stick.menu.FlashMode.qout.build.boot=qout
wireless_stick.menu.FlashMode.dout=DOUT
wireless_stick.menu.FlashMode.dout.build.flash_mode=dout
wireless_stick.menu.FlashMode.dout.build.boot=dout

wireless_stick.menu.FlashFreq.80=80MHz
wireless_stick.menu.FlashFreq.80.build.flash_freq=80m
wireless_stick.menu.FlashFreq.40=40MHz
wireless_stick.menu.FlashFreq.40.build.flash_freq=40m

wireless_stick.menu.FlashSize.8M=8MB (64Mb)
wireless_stick.menu.FlashSize.8M.build.flash_size=8MB
wireless_stick.menu.FlashSize.8M.build.partitions=default_8MB
wireless_stick.menu.FlashSize.4M=4MB (32Mb)
wireless_stick.menu.FlashSize.4M.build.flash_size=4MB
wireless_stick.menu.FlashSize.2M=2MB (16Mb)
wireless_stick.menu.FlashSize.2M.build.flash_size=2MB
wireless_stick.menu.FlashSize.2M.build.partitions=minimal
wireless_stick.menu.FlashSize.16M=16MB (128Mb)
wireless_stick.menu.FlashSize.16M.build.flash_size=16MB
wireless_stick.menu.FlashSize.16M.build.partitions=ffat

wireless_stick.menu.UploadSpeed.921600=921600
wireless_stick.menu.UploadSpeed.921600.upload.speed=921600
wireless_stick.menu.UploadSpeed.115200=115200
wireless_stick.menu.UploadSpeed.115200.upload.speed=115200
wireless_stick.menu.UploadSpeed.256000.windows=256000
wireless_stick.menu.UploadSpeed.256000.upload.speed=256000
wireless_stick.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_stick.menu.UploadSpeed.230400=230400
wireless_stick.menu.UploadSpeed.230400.upload.speed=230400
wireless_stick.menu.UploadSpeed.460800.linux=460800
wireless_stick.menu.UploadSpeed.460800.macosx=460800
wireless_stick.menu.UploadSpeed.460800.upload.speed=460800
wireless_stick.menu.UploadSpeed.512000.windows=512000
wireless_stick.menu.UploadSpeed.512000.upload.speed=512000

wireless_stick.menu.DebugLevel.none=None
wireless_stick.menu.DebugLevel.none.build.code_debug=0
wireless_stick.menu.DebugLevel.error=Error
wireless_stick.menu.DebugLevel.error.build.code_debug=1
wireless_stick.menu.DebugLevel.warn=Warn
wireless_stick.menu.DebugLevel.warn.build.code_debug=2
wireless_stick.menu.DebugLevel.info=Info
wireless_stick.menu.DebugLevel.info.build.code_debug=3
wireless_stick.menu.DebugLevel.debug=Debug
wireless_stick.menu.DebugLevel.debug.build.code_debug=4
wireless_stick.menu.DebugLevel.verbose=Verbose
wireless_stick.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

wireless_stick_lite.name=Wireless Stick Lite

wireless_stick_lite.upload.tool=esptool_py
wireless_stick_lite.upload.maximum_size=1310720
wireless_stick_lite.upload.maximum_data_size=327680
wireless_stick_lite.upload.wait_for_upload_port=true

wireless_stick_lite.serial.disableDTR=true
wireless_stick_lite.serial.disableRTS=true

wireless_stick_lite.build.mcu=esp32
wireless_stick_lite.build.core=esp32
wireless_stick_lite.build.variant=wireless_stick_lite
wireless_stick_lite.build.board=WIRELESS_STICK_LITE

wireless_stick_lite.build.f_cpu=240000000L
wireless_stick_lite.build.flash_size=4MB
wireless_stick_lite.build.flash_freq=80m
wireless_stick_lite.build.flash_mode=dio
wireless_stick_lite.build.boot=dio
wireless_stick_lite.build.partitions=default
wireless_stick_lite.build.defines=

wireless_stick_lite.menu.PSRAM.disabled=Disabled
wireless_stick_lite.menu.PSRAM.disabled.build.defines=
wireless_stick_lite.menu.PSRAM.enabled=Enabled
wireless_stick_lite.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

